tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
cask "adoptopenjdk8"
# AdoptOpenJDK main binary releases for OpenJDK 8 with HotSpot
brew "adoptopenjdk-openjdk8"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Top-like interface for container metrics
brew "ctop"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Distributed revision control system
brew "git"
# OpenGL Extension Wrangler Library
brew "glew"
# Core application library for C
brew "glib"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# USB multiplexor daemon for iPhone and iPod Touch devices
brew "usbmuxd", args: ["HEAD"]
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Cross-platform library for communicating with iOS devices
brew "ideviceinstaller"
# Database of common MIME types
brew "shared-mime-info"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Manage your Java environment
brew "jenv"
# Publish-subscribe messaging rethought as a distributed commit log
brew "kafka", restart_service: true
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kafkacat"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Build tool for Clojure
brew "leiningen"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Java-based project management
brew "maven"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Manage compile and link flags for libraries
brew "pkg-config"
# Monitor data's progress through a pipe
brew "pv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Command-line Reddit client
brew "rtv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Build tool for Scala projects
brew "sbt"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Sample multi-channel audio mixer library
brew "sdl2_mixer"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Multi-media library with bindings for multiple languages
brew "sfml"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Converts a ttyrec file into gif files
brew "ttygif"
# Extract, view, and test RAR archives
brew "unrar"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
cask "bitwarden"
cask "daisydisk"
cask "docker"
cask "firefox"
cask "flux"
cask "gimp"
cask "goland"
cask "google-chrome"
cask "intellij-idea-ce"
cask "java"
cask "java11"
cask "keepassx"
cask "licecap"
cask "macvim"
cask "openemu"
cask "postman"
cask "processing"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "steam"
cask "sublime-text3"
cask "the-unarchiver"
cask "unity"
cask "visual-studio-code"
cask "vlc"
cask "webstorm"
cask "xquartz"
